package com.rakovets.course.java.core.practice.math;

/**
 * Разработать программу для векторного графического редактора:
 * которая будет округлять вещественное значение координаты точки до ближайшего
 * целого значения координаты пикселя на мониторе, если известно:
 *
 * @param value - вещественное значение координаты точки
 */
class Task03 {
    public static void main(String[] args) {
        //FIXME
        // Ниже приведены значения присваиваемые переменным. Их можно изменять для проверки различных вариантов входных
        // аргументов. Типы данных изменять нельзя
        float value = 3.2f;

        // Код необходимый для тестирования, не изменять
        value = (args.length == 1) ? Float.parseFloat(args[0]) : value;

        //TODO
        // Код, решающий задачу пишем ниже, при этом используяся переменные объявленные выше (их можно изменять)
        // Для проверки решения необходимо запустить @Test для данного class (в директории test)
    }
}
