package com.rakovets.course.java.core.practice.decision_making_statements;

/**
 * Разработать программу для сервиса доставки.
 * <p>
 * Определить номер подъезда дома для текущего клиента.
 */
class Task09 {
    /**
     * The entry point of the task
     *
     * @param args entry arguments
     */
    public static void main(String[] args) {
        //FIXME
        // Ниже приведены значения присваиваемые переменным. Их можно изменять для проверки различных вариантов входных
        // аргументов. Типы данных изменять нельзя
        int numberFloors = 2;
        int numberApartmentsPerFloor = 10;
        int apartmentNumber = 45;

        int porchNumber = getPorchNumber(numberFloors, numberApartmentsPerFloor, apartmentNumber);
        System.out.printf("Result: %s", porchNumber);
    }

    /**
     * Определяет номер подъезда дома для текущего клиента.
     *
     * @param numberFloors             количество этажей
     * @param numberApartmentsPerFloor количество квартир на этаже
     * @param apartmentNumber          номер квартиры
     * @return номер подъезда
     */
    static int getPorchNumber(int numberFloors, int numberApartmentsPerFloor, int apartmentNumber) {

        int porchNumber = 0;
        int numberApartmentsPerPorch = numberFloors * numberApartmentsPerFloor;

        if (apartmentNumber > numberApartmentsPerPorch) {
            if (apartmentNumber % numberApartmentsPerPorch != 0) {
                porchNumber = apartmentNumber / numberApartmentsPerPorch + 1;
            }
        } else {
            porchNumber = 1;
        }
        return porchNumber;
    }
}
